tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "neovim/neovim"

brew "asdf"
brew "autopep8"
brew "awscli"
brew "fd"
brew "fdupes"
brew "fish"
brew "fzf"
brew "git"
brew "gnupg"
brew "jq"
brew "neovim"
brew "openssl"
brew "readline"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "zlib"
brew "kubectl" 
brew "kubectx" 
brew "awscli"
brew "aws-iam-authenticator"
brew "hyperkit"
brew "docker-machine-driver-hyperkit"
brew "pre-commit"

cask "alacritty"
cask "discord"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code"
cask "font-hasklig"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "iterm2-beta"
cask "karabiner-elements"
cask "kitty"
cask "ngrok"
cask "spectacle"
cask "typora"
cask "minikube"
cask "flux"

brew "direnv"
